# **PROBLEMA DE NEGOCIO**


---

### Una tienda online de moda, con presencia en todo Brasil, necesita impulsar su rendimiento utilizando sus datos de manera estratégica. Como científico de datos, has sido convocado para analizar estos datos y ofrecer insights que guíen sus decisiones y respondan a algunas preguntas claves

# **1. Configuración del Ambiente**


---

In [207]:
# !pip install geobr
import geobr
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from matplotlib.patches import FancyBboxPatch
from matplotlib.offsetbox import OffsetImage, AnnotationBbox
import matplotlib.dates as mdates
from matplotlib.ticker import FuncFormatter
import matplotlib.ticker as ticker
from sqlalchemy import create_engine, MetaData, Table, Column, Integer, String, Float, Date, ForeignKey, text
from sqlalchemy.orm import sessionmaker

# **2. Obtención, Tratamiento y Análisis Exploratório (EDA)**


---

## **2.1 Cargando las bases de datos**

In [208]:
# Carga de datos locales
local = True

In [209]:
if local:
    df_itens_pedidos = pd.read_csv('itens_pedidos.csv')
    df_pedidos = pd.read_csv('pedidos.csv')
    df_productos = pd.read_csv('productos.csv')
    df_vendedores = pd.read_csv('vendedores.csv')

In [210]:
if not local:
    df_itens_pedidos = pd.read_csv('https://raw.githubusercontent.com/ElProfeAlejo/Bootcamp_Databases/main/itens_pedidos.csv')
    df_itens_pedidos.to_csv('itens_pedidos.csv', index=False)

In [211]:
df_itens_pedidos

,id_recibo,producto_id,pedido_id,cantidad,valor_unitario,valor_total,ciudad,costo_envio
0,1,41518,341,3,260,780,BR-BA,156.0
1,2,4307,1174,5,6175,30875,BR-RJ,6175.0
2,3,22407,1399,3,200,600,BR-PB,120.0
3,4,3820,1652,6,139,834,BR-DF,166.8
4,5,29012,2470,3,525,1575,BR-BA,315.0
...,...,...,...,...,...,...,...,...
24522,25051,64127,63716,4,590,2360,BR-PE,472.0
24523,25052,37384,63999,4,700,2800,BR-RO,560.0
24524,25053,100932,64594,5,3900,19500,BR-RO,3900.0
24525,25054,3820,64811,3,139,417,BR-MA,83.4
24526,25055,74864,65274,2,130,260,BR-SE,52.0

In [212]:
if not local:    
    df_pedidos = pd.read_csv('https://raw.githubusercontent.com/ElProfeAlejo/Bootcamp_Databases/main/pedidos.csv')
    df_pedidos.to_csv('pedidos.csv', index=False)

In [213]:
df_pedidos

       pedido_id  producto_id  vendedor_id fecha_compra  total
0            341        41518            6   2019-01-05    780
1           1174         4307            3   2019-01-05  30875
2           1399        22407            1   2019-01-05    600
3           1652         3820            4   2019-01-05    834
4           2470        29012            2   2019-01-05   1575
...          ...          ...          ...          ...    ...
24522      63716        64127            1   2021-03-09   2360
24523      63999        37384            2   2021-03-09   2800
24524      64594       100932            1   2021-03-10  19500
24525      64811         3820            3   2021-03-10    417
24526      65274        74864            4   2021-03-10    260

[24527 rows x 5 columns]

In [214]:
if not local:
    df_productos = pd.read_csv('https://raw.githubusercontent.com/ElProfeAlejo/Bootcamp_Databases/main/productos.csv')
    df_productos.to_csv('productos.csv', index=False)

In [215]:
df_productos

,producto_id,producto,precio,marca,sku,condicion
0,21244,Oculos Lente Azulada,1120,D&g Dolce & Gabbana,209297.0,Usado
1,9981,Bolsa Coral Saco,4000,Givenchy,278612.0,Usado
2,84176,Camisa Xadrez Verde,310,Joe Fresh,322482.0,Usado
3,47475,Calca Alfaiataria Preta,490,Mixed,263658.0,Usado
4,74864,Vestido Jeans Babados,130,Zara,219248.0,Usado
...,...,...,...,...,...,...
202,22568,Casaqueto Estampa Geometrica,245,Zara,244931.0,Usado
203,40508,Regata Bicolor Alcinha,245,Express,247166.0,Usado
204,41518,Calca Jeans Basica,260,Banana Republic,255410.0,Nuevo con etiqueta
205,41598,NaN,260,Banana Republic,NaN,Nuevo con etiqueta
206,32926,NaN,210,Limone By Jade Seba,NaN,Nuevo sin etiqueta

In [216]:
if not local:
    df_vendedores = pd.read_csv('https://raw.githubusercontent.com/ElProfeAlejo/Bootcamp_Databases/main/vendedores.csv')
    df_vendedores.to_csv('vendedores.csv', index=False)

In [217]:
df_vendedores

   vendedor_id  nombre_vendedor
0            1       Ana Duarte
1            2  Daniel Siqueira
2            3   Nadia Oliveira
3            4  Millena Pereira
4            5    Paulo Calanca
5            6          Unknown

## **2.2 Analisis, Observaciones y Conclusiones**

In [218]:
print(df_itens_pedidos.info())
print('-------------')
print(df_pedidos.info())
print('-------------')
print(df_productos.info())
print('-------------')
print(df_vendedores.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24527 entries, 0 to 24526
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_recibo       24527 non-null  int64
 1   producto_id     24527 non-null  int64
 2   pedido_id       24527 non-null  int64
 3   cantidad        24527 non-null  int64
 4   valor_unitario  24527 non-null  int64
 5   valor_total     24527 non-null  int64
 6   ciudad          24527 non-null  object
 7   costo_envio     24527 non-null  float64
dtypes: float64(1), int64(6), object(1)
memory usage: 1.5+ MB
None
-------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24527 entries, 0 to 24526
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   pedido_id     24527 non-null  int64
 1   producto_id   24527 non-null  int64
 2   vendedor_id   24527 non-null  int64
 3   fecha_compra  24527 non-null  object
 4   total         24527 non-null  int64
dtypes: int64(4), object(1)
memory usage: 958.2+ KB
None
-------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 207 entries, 0 to 206
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   producto_id  207 non-null    int64
 1   producto     205 non-null    object
 2   precio       207 non-null    int64
 3   marca        207 non-null    object
 4   sku          205 non-null    float64
 5   condicion    207 non-null    object
dtypes: float64(1), int64(2), object(3)
memory usage: 9.8+ KB
None
-------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   vendedor_id      6 non-null      int64
 1   nombre_vendedor  6 non-null      object
dtypes: int64(1), object(1)
memory usage: 228.0+ bytes
None

---

Vendedores

In [219]:
df_pedidos[df_pedidos['vendedor_id'] == 6]

   pedido_id  producto_id  vendedor_id fecha_compra  total
0        341        41518            6   2019-01-05    780

In [220]:
df_itens_pedidos[df_itens_pedidos['pedido_id'] == 341]

,id_recibo,producto_id,pedido_id,cantidad,valor_unitario,valor_total,ciudad,costo_envio
0,1,41518,341,3,260,780,BR-BA,156.0

In [221]:
df_pedidos[df_pedidos['pedido_id'].isin(df_itens_pedidos[df_itens_pedidos['ciudad']=='BR-BA']['pedido_id'])]

       pedido_id  producto_id  vendedor_id fecha_compra  total
0            341        41518            6   2019-01-05    780
4           2470        29012            2   2019-01-05   1575
16          6355         3820            5   2019-01-11    556
21         10809        12609            1   2019-01-14   1600
34         16923         4553            5   2019-01-17    220
...          ...          ...          ...          ...    ...
24461      19227        83866            4   2021-02-20    990
24476      28011        29893            4   2021-02-20    840
24487      35555         9809            3   2021-02-20   1560
24494      41529        12812            2   2021-02-21   1280
24498      44968        51314            1   2021-02-21   2460

[894 rows x 5 columns]

In [222]:
df_pedidos[df_pedidos['fecha_compra']=='2019-01-05']

   pedido_id  producto_id  vendedor_id fecha_compra  total
0        341        41518            6   2019-01-05    780
1       1174         4307            3   2019-01-05  30875
2       1399        22407            1   2019-01-05    600
3       1652         3820            4   2019-01-05    834
4       2470        29012            2   2019-01-05   1575
5       2980        72621            1   2019-01-05    537
6       3443        86243            3   2019-01-05   1400
7       3557        29012            4   2019-01-05   2625
8       3585        61071            1   2019-01-05   1350

itens_pedidos

In [223]:
df_productos[['producto', 'marca', 'condicion']].value_counts()

producto                   marca        condicion
Saia Pregas Preta          Zara         Usado                 2
Bata Pink Decote           Loft 747     Nuevo con etiqueta    1
Sandalia Prata Pedraria    Thay Ribas   Usado                 1
Saia Pregas Azul           Carina Duek  Nuevo con etiqueta    1
Saia Preta Babado          Mixed        Usado                 1
                                                             ..
Camisa Acetinada Mostarda  Thelure      Usado                 1
Camisa Amarela Laco        Carol Bassi  Usado                 1
Camisa Fio Animalprint     Bobô         Usado                 1
Camisa Jeans Azul          Zara         Usado                 1
Vestido Ziper Fendi        Thelure      Usado                 1
Name: count, Length: 204, dtype: int64

In [224]:
df_productos[df_productos['precio']==210]

,producto_id,producto,precio,marca,sku,condicion
22,23575,Camiseta Animal Print,210,284,283163.0,Usado
72,70673,Shorts Listras Bordados,210,American Eagle,126190.0,Usado
86,45878,Vestido Preto Bolso,210,Zara,114614.0,Usado
149,50330,Camisa Jeans Azul,210,Zara,250096.0,Usado
152,5567,Vestido Medio Florl,210,Amaro,525428.0,Usado
164,65473,Oculos Acetato Branco,210,Mango,944049.0,Usado
183,32126,Saia Midi Cinto,210,Limone By Jade Seba,302628.0,Nuevo sin etiqueta
206,32926,NaN,210,Limone By Jade Seba,NaN,Nuevo sin etiqueta

In [225]:
df_productos.producto_id.nunique()

207

In [226]:
df_productos[df_productos['producto'].isna()]

,producto_id,producto,precio,marca,sku,condicion
205,41598,NaN,260,Banana Republic,NaN,Nuevo con etiqueta
206,32926,NaN,210,Limone By Jade Seba,NaN,Nuevo sin etiqueta

In [227]:
df_itens_pedidos[df_itens_pedidos['producto_id']==41598]

Empty DataFrame
Columns: [id_recibo, producto_id, pedido_id, cantidad, valor_unitario, valor_total, ciudad, costo_envio]
Index: []

In [228]:
df_itens_pedidos[df_itens_pedidos['producto_id']==32926]

Empty DataFrame
Columns: [id_recibo, producto_id, pedido_id, cantidad, valor_unitario, valor_total, ciudad, costo_envio]
Index: []

pedidos

In [229]:
df_pedidos

       pedido_id  producto_id  vendedor_id fecha_compra  total
0            341        41518            6   2019-01-05    780
1           1174         4307            3   2019-01-05  30875
2           1399        22407            1   2019-01-05    600
3           1652         3820            4   2019-01-05    834
4           2470        29012            2   2019-01-05   1575
...          ...          ...          ...          ...    ...
24522      63716        64127            1   2021-03-09   2360
24523      63999        37384            2   2021-03-09   2800
24524      64594       100932            1   2021-03-10  19500
24525      64811         3820            3   2021-03-10    417
24526      65274        74864            4   2021-03-10    260

[24527 rows x 5 columns]

* ``df_vendedores``: vendedor_id 6 sin Nombre
    * Una venta el 2019-01-05 por valor 780
    * No pudimos inferir sobre quien es el vendedor en cuestion
    * **Solucion**: no tenerlo en cuenta para vendedores individuales
* ``df_itens_pedidos``: ademas ver productos
    * "ciudad" esta en un formato que no es estandard para geobr
    * **Solucion**: quitaremos BR_
* ``df_pedidos``: "fecha_compra" a tipo datetime
* ``df_productos``: no hay pedidos con los productos que no sabemos su nombre:
    * De todas formas podemos inferir que el primer producto (41598) es "Calca Jeans Basica" y el segundo producto (32926) es "Saia Midi Cinto" de acuerdo a su precio y marca
    * A su vez sus "SKU" (Stock Keeping Unit) son 255410 y 302628 respectivamente
    * **Solucion**: eliminarlos por estar mal registrados (duplicados)

---

## **2.3 Tratamiento de Datos**

In [230]:
def preprocesamiento():
  df_productos.dropna(subset=['producto'], inplace=True)
  df_itens_pedidos['ciudad'] = df_itens_pedidos['ciudad'].str.replace('BR-', '')
  df_pedidos['fecha_compra'] = pd.to_datetime(df_pedidos['fecha_compra'])

In [231]:
preprocesamiento()
print(df_itens_pedidos.info())
print('-------------')
print(df_pedidos.info())
print('-------------')
print(df_productos.info())
print('-------------')
print(df_vendedores.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24527 entries, 0 to 24526
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_recibo       24527 non-null  int64
 1   producto_id     24527 non-null  int64
 2   pedido_id       24527 non-null  int64
 3   cantidad        24527 non-null  int64
 4   valor_unitario  24527 non-null  int64
 5   valor_total     24527 non-null  int64
 6   ciudad          24527 non-null  object
 7   costo_envio     24527 non-null  float64
dtypes: float64(1), int64(6), object(1)
memory usage: 1.5+ MB
None
-------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24527 entries, 0 to 24526
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   pedido_id     24527 non-null  int64
 1   producto_id   24527 non-null  int64
 2   vendedor_id   24527 non-null  int64
 3   fecha_compra  24527 non-null  datetime64[ns]
 4   total         24527 non-null  int64
dtypes: datetime64[ns](1), int64(4)
memory usage: 958.2 KB
None
-------------
<class 'pandas.core.frame.DataFrame'>
Index: 205 entries, 0 to 204
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   producto_id  205 non-null    int64
 1   producto     205 non-null    object
 2   precio       205 non-null    int64
 3   marca        205 non-null    object
 4   sku          205 non-null    float64
 5   condicion    205 non-null    object
dtypes: float64(1), int64(2), object(3)
memory usage: 11.2+ KB
None
-------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   vendedor_id      6 non-null      int64
 1   nombre_vendedor  6 non-null      object
dtypes: int64(1), object(1)
memory usage: 228.0+ bytes
None

## **2.4 Creando el Banco de Datos y las Herramientas para Utilizarlo**

In [232]:
# Crearemos una base de datos sql con sqlalchemy
def crear_conexion():
  # Crear conexión a la base de datos
  engine = create_engine('sqlite:///tienda.db', echo=True)
  return engine

engine = crear_conexion()

In [233]:
# Creamos Tbalas
def crear_tablas(engine):
  # Crear las tablas
  metadata = MetaData()
  Table('productos', metadata,
        Column('producto_id', Integer, primary_key=True),
        Column('producto', String),
        Column('marca', String),
        Column('precio', Float),
        Column('condicion', String)
        )
  Table('vendedores', metadata,
        Column('vendedor_id', Integer, primary_key=True),
        Column('nombre', String),
        Column('ciudad', String)
        )
  Table('pedidos', metadata,
        Column('pedido_id', Integer, primary_key=True),
        Column('fecha_compra', Date),
        Column('vendedor_id', Integer, ForeignKey('vendedores.vendedor_id'))
        )
  Table('itens_pedidos', metadata,
        Column('item_id', Integer, primary_key=True),
        Column('pedido_id', Integer, ForeignKey('pedidos.pedido_id')),
        Column('producto_id', Integer, ForeignKey('productos.producto_id')),
        Column('cantidad', Integer),
        Column('precio', Float),
        Column('ciudad', String)
        )
  metadata.create_all(engine)

crear_tablas(engine)

2024-04-09 22:45:25,721 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-04-09 22:45:25,721 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("productos")
2024-04-09 22:45:25,722 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,724 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("vendedores")
2024-04-09 22:45:25,725 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,726 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("pedidos")
2024-04-09 22:45:25,727 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,728 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("itens_pedidos")
2024-04-09 22:45:25,729 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,730 INFO sqlalchemy.engine.Engine COMMIT

In [234]:
def cargar_datos(engine):
  # Cargar los datos
  df_productos.to_sql('productos', con=engine, if_exists='replace', index=False)
  df_vendedores.to_sql('vendedores', con=engine, if_exists='replace', index=False)
  df_pedidos.to_sql('pedidos', con=engine, if_exists='replace', index=False)
  df_itens_pedidos.to_sql('itens_pedidos', con=engine, if_exists='replace', index=False)

cargar_datos(engine)

2024-04-09 22:45:25,742 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-04-09 22:45:25,745 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("productos")
2024-04-09 22:45:25,747 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,749 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("productos")
2024-04-09 22:45:25,750 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,752 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-04-09 22:45:25,753 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,755 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='view' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-04-09 22:45:25,756 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,757 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("productos")
2024-04-09 22:45:25,758 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,760 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-04-09 22:45:25,761 INFO sqlalchemy.engine.Engine [raw sql] ('productos',)
2024-04-09 22:45:25,762 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("productos")
2024-04-09 22:45:25,763 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,764 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("productos")
2024-04-09 22:45:25,765 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,766 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-04-09 22:45:25,767 INFO sqlalchemy.engine.Engine [raw sql] ('productos',)
2024-04-09 22:45:25,769 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("productos")
2024-04-09 22:45:25,770 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,771 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("productos")
2024-04-09 22:45:25,772 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,773 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("productos")
2024-04-09 22:45:25,774 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,775 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("productos")
2024-04-09 22:45:25,776 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,777 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("productos")
2024-04-09 22:45:25,778 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,779 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("productos")
2024-04-09 22:45:25,780 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,782 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-04-09 22:45:25,783 INFO sqlalchemy.engine.Engine [raw sql] ('productos',)
2024-04-09 22:45:25,785 INFO sqlalchemy.engine.Engine
DROP TABLE productos
2024-04-09 22:45:25,786 INFO sqlalchemy.engine.Engine [no key 0.00081s] ()
2024-04-09 22:45:25,793 INFO sqlalchemy.engine.Engine
CREATE TABLE productos (
	producto_id BIGINT,
	producto TEXT,
	precio BIGINT,
	marca TEXT,
	sku FLOAT,
	condicion TEXT
)


2024-04-09 22:45:25,794 INFO sqlalchemy.engine.Engine [no key 0.00107s] ()
2024-04-09 22:45:25,803 INFO sqlalchemy.engine.Engine INSERT INTO productos (producto_id, producto, precio, marca, sku, condicion) VALUES (?, ?, ?, ?, ?, ?)
2024-04-09 22:45:25,805 INFO sqlalchemy.engine.Engine [generated in 0.00227s] [(21244, 'Oculos Lente Azulada', 1120, 'D&g Dolce & Gabbana', 209297.0, 'Usado'), (9981, 'Bolsa Coral Saco', 4000, 'Givenchy', 278612.0, 'Usado'), (84176, 'Camisa Xadrez Verde', 310, 'Joe Fresh', 322482.0, 'Usado'), (47475, 'Calca Alfaiataria Preta', 490, 'Mixed', 263658.0, 'Usado'), (74864, 'Vestido Jeans Babados', 130, 'Zara', 219248.0, 'Usado'), (51238, 'Mala Bolsos Preta', 410, 'Gap', 286008.0, 'Usado'), (21429, 'Casaco Preto Botoes', 390, 'Banana Republic', 321380.0, 'Usado'), (44207, 'Calca Estampa Pb', 290, 'Fyi', 294021.0, 'Usado')  ... displaying 10 of 205 total bound parameter sets ...  (40508, 'Regata Bicolor Alcinha', 245, 'Express', 247166.0, 'Usado'), (41518, 'Calca Jeans Basica', 260, 'Banana Republic', 255410.0, 'Nuevo con etiqueta')]
2024-04-09 22:45:25,808 INFO sqlalchemy.engine.Engine COMMIT
2024-04-09 22:45:25,814 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-04-09 22:45:25,816 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("vendedores")
2024-04-09 22:45:25,817 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,819 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("vendedores")
2024-04-09 22:45:25,819 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,821 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-04-09 22:45:25,821 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,823 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='view' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-04-09 22:45:25,824 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,826 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("vendedores")
2024-04-09 22:45:25,826 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,828 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-04-09 22:45:25,829 INFO sqlalchemy.engine.Engine [raw sql] ('vendedores',)
2024-04-09 22:45:25,831 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("vendedores")
2024-04-09 22:45:25,832 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,833 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("vendedores")
2024-04-09 22:45:25,835 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,836 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-04-09 22:45:25,837 INFO sqlalchemy.engine.Engine [raw sql] ('vendedores',)
2024-04-09 22:45:25,838 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("vendedores")
2024-04-09 22:45:25,839 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,840 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("vendedores")
2024-04-09 22:45:25,842 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,843 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("vendedores")
2024-04-09 22:45:25,844 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,845 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("vendedores")
2024-04-09 22:45:25,846 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,848 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("vendedores")
2024-04-09 22:45:25,849 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,851 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("vendedores")
2024-04-09 22:45:25,851 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,853 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-04-09 22:45:25,853 INFO sqlalchemy.engine.Engine [raw sql] ('vendedores',)
2024-04-09 22:45:25,855 INFO sqlalchemy.engine.Engine
DROP TABLE vendedores
2024-04-09 22:45:25,856 INFO sqlalchemy.engine.Engine [no key 0.00071s] ()
2024-04-09 22:45:25,861 INFO sqlalchemy.engine.Engine
CREATE TABLE vendedores (
	vendedor_id BIGINT,
	nombre_vendedor TEXT
)


2024-04-09 22:45:25,863 INFO sqlalchemy.engine.Engine [no key 0.00119s] ()
2024-04-09 22:45:25,871 INFO sqlalchemy.engine.Engine INSERT INTO vendedores (vendedor_id, nombre_vendedor) VALUES (?, ?)
2024-04-09 22:45:25,872 INFO sqlalchemy.engine.Engine [generated in 0.00117s] [(1, 'Ana Duarte'), (2, 'Daniel Siqueira'), (3, 'Nadia Oliveira'), (4, 'Millena Pereira'), (5, 'Paulo Calanca'), (6, 'Unknown')]
2024-04-09 22:45:25,875 INFO sqlalchemy.engine.Engine COMMIT
2024-04-09 22:45:25,880 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-04-09 22:45:25,882 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("pedidos")
2024-04-09 22:45:25,883 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,884 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("pedidos")
2024-04-09 22:45:25,885 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,886 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-04-09 22:45:25,887 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,887 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='view' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-04-09 22:45:25,888 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,890 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("pedidos")
2024-04-09 22:45:25,890 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,892 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-04-09 22:45:25,893 INFO sqlalchemy.engine.Engine [raw sql] ('pedidos',)
2024-04-09 22:45:25,894 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("pedidos")
2024-04-09 22:45:25,895 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,896 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("pedidos")
2024-04-09 22:45:25,897 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,898 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-04-09 22:45:25,899 INFO sqlalchemy.engine.Engine [raw sql] ('pedidos',)
2024-04-09 22:45:25,900 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("pedidos")
2024-04-09 22:45:25,901 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,902 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("pedidos")
2024-04-09 22:45:25,903 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,904 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("pedidos")
2024-04-09 22:45:25,905 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,906 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("pedidos")
2024-04-09 22:45:25,907 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,908 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("pedidos")
2024-04-09 22:45:25,908 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,909 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("pedidos")
2024-04-09 22:45:25,910 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:25,911 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-04-09 22:45:25,911 INFO sqlalchemy.engine.Engine [raw sql] ('pedidos',)
2024-04-09 22:45:25,913 INFO sqlalchemy.engine.Engine
DROP TABLE pedidos
2024-04-09 22:45:25,914 INFO sqlalchemy.engine.Engine [no key 0.00089s] ()
2024-04-09 22:45:25,921 INFO sqlalchemy.engine.Engine
CREATE TABLE pedidos (
	pedido_id BIGINT,
	producto_id BIGINT,
	vendedor_id BIGINT,
	fecha_compra DATETIME,
	total BIGINT
)


2024-04-09 22:45:25,922 INFO sqlalchemy.engine.Engine [no key 0.00089s] ()
2024-04-09 22:45:26,054 INFO sqlalchemy.engine.Engine INSERT INTO pedidos (pedido_id, producto_id, vendedor_id, fecha_compra, total) VALUES (?, ?, ?, ?, ?)
2024-04-09 22:45:26,055 INFO sqlalchemy.engine.Engine [generated in 0.10259s] [(341, 41518, 6, '2019-01-05 00:00:00.000000', 780), (1174, 4307, 3, '2019-01-05 00:00:00.000000', 30875), (1399, 22407, 1, '2019-01-05 00:00:00.000000', 600), (1652, 3820, 4, '2019-01-05 00:00:00.000000', 834), (2470, 29012, 2, '2019-01-05 00:00:00.000000', 1575), (2980, 72621, 1, '2019-01-05 00:00:00.000000', 537), (3443, 86243, 3, '2019-01-05 00:00:00.000000', 1400), (3557, 29012, 4, '2019-01-05 00:00:00.000000', 2625)  ... displaying 10 of 24527 total bound parameter sets ...  (64811, 3820, 3, '2021-03-10 00:00:00.000000', 417), (65274, 74864, 4, '2021-03-10 00:00:00.000000', 260)]
2024-04-09 22:45:26,093 INFO sqlalchemy.engine.Engine COMMIT
2024-04-09 22:45:26,100 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-04-09 22:45:26,103 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("itens_pedidos")
2024-04-09 22:45:26,104 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:26,105 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("itens_pedidos")
2024-04-09 22:45:26,106 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:26,107 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-04-09 22:45:26,108 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:26,109 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='view' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-04-09 22:45:26,109 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:26,111 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("itens_pedidos")
2024-04-09 22:45:26,111 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:26,113 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-04-09 22:45:26,113 INFO sqlalchemy.engine.Engine [raw sql] ('itens_pedidos',)
2024-04-09 22:45:26,114 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("itens_pedidos")
2024-04-09 22:45:26,115 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:26,116 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("itens_pedidos")
2024-04-09 22:45:26,117 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:26,118 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-04-09 22:45:26,119 INFO sqlalchemy.engine.Engine [raw sql] ('itens_pedidos',)
2024-04-09 22:45:26,120 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("itens_pedidos")
2024-04-09 22:45:26,121 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:26,122 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("itens_pedidos")
2024-04-09 22:45:26,123 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:26,123 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("itens_pedidos")
2024-04-09 22:45:26,124 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:26,125 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("itens_pedidos")
2024-04-09 22:45:26,126 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:26,127 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("itens_pedidos")
2024-04-09 22:45:26,128 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:26,129 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("itens_pedidos")
2024-04-09 22:45:26,129 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-04-09 22:45:26,131 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-04-09 22:45:26,131 INFO sqlalchemy.engine.Engine [raw sql] ('itens_pedidos',)
2024-04-09 22:45:26,133 INFO sqlalchemy.engine.Engine
DROP TABLE itens_pedidos
2024-04-09 22:45:26,134 INFO sqlalchemy.engine.Engine [no key 0.00065s] ()
2024-04-09 22:45:26,141 INFO sqlalchemy.engine.Engine
CREATE TABLE itens_pedidos (
	id_recibo BIGINT,
	producto_id BIGINT,
	pedido_id BIGINT,
	cantidad BIGINT,
	valor_unitario BIGINT,
	valor_total BIGINT,
	ciudad TEXT,
	costo_envio FLOAT
)


2024-04-09 22:45:26,141 INFO sqlalchemy.engine.Engine [no key 0.00066s] ()
2024-04-09 22:45:26,268 INFO sqlalchemy.engine.Engine INSERT INTO itens_pedidos (id_recibo, producto_id, pedido_id, cantidad, valor_unitario, valor_total, ciudad, costo_envio) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
2024-04-09 22:45:26,270 INFO sqlalchemy.engine.Engine [generated in 0.09805s] [(1, 41518, 341, 3, 260, 780, 'BA', 156.0), (2, 4307, 1174, 5, 6175, 30875, 'RJ', 6175.0), (3, 22407, 1399, 3, 200, 600, 'PB', 120.0), (4, 3820, 1652, 6, 139, 834, 'DF', 166.8), (5, 29012, 2470, 3, 525, 1575, 'BA', 315.0), (6, 72621, 2980, 3, 179, 537, 'MG', 107.4), (7, 86243, 3443, 4, 350, 1400, 'PR', 280.0), (8, 29012, 3557, 5, 525, 2625, 'MS', 525.0)  ... displaying 10 of 24527 total bound parameter sets ...  (25054, 3820, 64811, 3, 139, 417, 'MA', 83.4), (25055, 74864, 65274, 2, 130, 260, 'SE', 52.0)]
2024-04-09 22:45:26,325 INFO sqlalchemy.engine.Engine COMMIT

In [235]:
# Creamos la funcion de consulta
def consultar(query, engine):
    # Crear una sesión
    Session = sessionmaker(bind=engine)
    session = Session()

    try:
        # Ejecutar la consulta
        result = session.execute(text(query))
        
        # Devolver los resultados
        return result.fetchall()
    except Exception as e:
        print(f"Ocurrió un error al ejecutar la consulta: {e}")
    finally:
        # Cerrar la sesión
        session.close()